sterentev/atdf-device-asm-include/inc/ATtiny1634.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	TWSCRA		= 0x7F		; [MEMORY MAPPED] TWI Slave Control Register A
.equ	TWSCRB		= 0x7E		; [MEMORY MAPPED] TWI Slave Control Register B
.equ	TWSSRA		= 0x7D		; [MEMORY MAPPED] TWI Slave Status Register A
.equ	TWSA		= 0x7C		; [MEMORY MAPPED] TWI Slave Address Register
.equ	TWSAM		= 0x7B		; [MEMORY MAPPED] TWI Slave Address Mask Register
.equ	TWSD		= 0x7A		; [MEMORY MAPPED] TWI Slave Data Register
.equ	UCSR1A		= 0x79		; [MEMORY MAPPED] USART Control and Status Register A
.equ	UCSR1B		= 0x78		; [MEMORY MAPPED] USART Control and Status Register B
.equ	UCSR1C		= 0x77		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UCSR1D		= 0x76		; [MEMORY MAPPED] USART Control and Status Register D
.equ	UBRR1		= 0x74		; [MEMORY MAPPED] USART Baud Rate Register  Bytes
.equ	UDR1		= 0x73		; [MEMORY MAPPED] USART I/O Data Register
.equ	TCCR1A		= 0x72		; [MEMORY MAPPED] Timer/Counter1 Control Register A
.equ	TCCR1B		= 0x71		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1C		= 0x70		; [MEMORY MAPPED] Timer/Counter1 Control Register C
.equ	TCNT1		= 0x6E		; [MEMORY MAPPED] Timer/Counter1  Bytes
.equ	OCR1A		= 0x6C		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1B		= 0x6A		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register  Bytes
.equ	ICR1		= 0x68		; [MEMORY MAPPED] Timer/Counter1 Input Capture Register  Bytes
.equ	GTCCR		= 0x67		; [MEMORY MAPPED] General Timer/Counter Control Register
.equ	OSCCAL1		= 0x66		; [MEMORY MAPPED] 
.equ	OSCTCAL0B	= 0x65		; [MEMORY MAPPED] 
.equ	OSCTCAL0A	= 0x64		; [MEMORY MAPPED] 
.equ	OSCCAL0		= 0x63		; [MEMORY MAPPED] Oscillator Calibration Value
.equ	DIDR2		= 0x62		; [MEMORY MAPPED] Digital Input Disable Register 2
.equ	DIDR1		= 0x61		; [MEMORY MAPPED] Digital Input Disable Register 1
.equ	DIDR0		= 0x60		; [MEMORY MAPPED] Digital Input Disable Register 0
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	GIMSK		= 0x3C		; General Interrupt Mask Register
.equ	GIFR		= 0x3B		; General Interrupt Flag Register
.equ	TIMSK		= 0x3A		; Timer/Counter Interrupt Mask Register
.equ	TIFR		= 0x39		; Timer/Counter Interrupt Flag register
.equ	SPMCSR		= 0x37		; Store Program Memory Control and Status Register
.equ	MCUCR		= 0x36		; MCU Control Register
.equ	MCUSR		= 0x35		; MCU Status Register
.equ	PRR		= 0x34		; Power Reduction Register
.equ	CLKPR		= 0x33		; Clock Prescale Register
.equ	CLKSR		= 0x32		; Clock Setting Register
.equ	WDTCSR		= 0x30		; Watchdog Timer Control and Status Register
.equ	CCP		= 0x2F		; Configuration Change Protection
.equ	USIBR		= 0x2D		; USI Buffer Register
.equ	USIDR		= 0x2C		; USI Data Register
.equ	USISR		= 0x2B		; USI Status Register
.equ	USICR		= 0x2A		; USI Control Register
.equ	PCMSK2		= 0x29		; Pin Change Mask Register 2
.equ	PCMSK1		= 0x28		; Pin Change Mask Register 1
.equ	PCMSK0		= 0x27		; Pin Change Mask Register 0
.equ	UCSR0A		= 0x26		; USART Control and Status Register A
.equ	UCSR0B		= 0x25		; USART Control and Status Register B
.equ	UCSR0C		= 0x24		; USART Control and Status Register C
.equ	UCSR0D		= 0x23		; USART Control and Status Register D
.equ	UBRR0		= 0x21		; USART Baud Rate Register  Bytes
.equ	UDR0		= 0x20		; USART I/O Data Register
.equ	EEAR		= 0x1E		; EEPROM Read/Write Access
.equ	EEDR		= 0x1D		; EEPROM Data Register
.equ	EECR		= 0x1C		; EEPROM Control Register
.equ	TCCR0A		= 0x1B		; Timer/Counter  Control Register A
.equ	TCCR0B		= 0x1A		; Timer/Counter Control Register B
.equ	TCNT0		= 0x19		; Timer/Counter0
.equ	OCR0A		= 0x18		; Timer/Counter0 Output Compare Register
.equ	OCR0B		= 0x17		; Timer/Counter0 Output Compare Register
.equ	GPIOR2		= 0x16		; General Purpose I/O Register 2
.equ	GPIOR1		= 0x15		; General Purpose I/O Register 1
.equ	GPIOR0		= 0x14		; General Purpose I/O Register 0
.equ	PORTCR		= 0x13		; Port Control Register
.equ	PUEA		= 0x12		; Pull-up Enable Control Register
.equ	PORTA		= 0x11		; Port A Data Register
.equ	DDRA		= 0x10		; Data Direction Register, Port A
.equ	PINA		= 0x0F		; Port A Input Pins
.equ	PUEB		= 0x0E		; Pull-up Enable Control Register
.equ	PORTB		= 0x0D		; Input Pins, Port B
.equ	DDRB		= 0x0C		; Data Direction Register, Port B
.equ	PINB		= 0x0B		; Port B Data register
.equ	PUEC		= 0x0A		; Pull-up Enable Control Register
.equ	PORTC		= 0x09		; Port C Data Register
.equ	DDRC		= 0x08		; Data Direction Register, Port C
.equ	PINC		= 0x07		; Port C Input Pins
.equ	ACSRA		= 0x06		; Analog Comparator Control And Status Register A
.equ	ACSRB		= 0x05		; Analog Comparator Control And Status Register B
.equ	ADMUX		= 0x04		; The ADC multiplexer Selection Register
.equ	ADCSRA		= 0x03		; The ADC Control and Status register
.equ	ADCSRB		= 0x02		; ADC Control and Status Register B
.equ	ADC		= 0x00		; ADC Data Register  Bytes


; ====	TWI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TWSCRA bits		------------------------
.equ	TWSHE		= 7		; 0x80 - TWI SDA Hold Time Enable
.equ	TWDIE		= 5		; 0x20 - TWI Data Interrupt Enable
.equ	TWASIE		= 4		; 0x10 - TWI Address/Stop Interrupt Enable
.equ	TWEN		= 3		; 0x08 - Two-Wire Interface Enable
.equ	TWSIE		= 2		; 0x04 - TWI Stop Interrupt Enable
.equ	TWPME		= 1		; 0x02 - TWI Promiscuous Mode Enable
.equ	TWSME		= 0		; 0x01 - TWI Smart Mode Enable

; ----------	Register TWSCRB bits		------------------------
.equ	TWAA		= 2		; 0x04 - TWI Acknowledge Action
.equ	TWCMD_MASK	= 0x03		;      -  (2 bits)
.equ	TWCMD0		= 0		;          TWCMD BIT0 position

; ----------	Register TWSSRA bits		------------------------
.equ	TWDIF		= 7		; 0x80 - TWI Data Interrupt Flag
.equ	TWASIF		= 6		; 0x40 - TWI Address/Stop Interrupt Flag
.equ	TWCH		= 5		; 0x20 - TWI Clock Hold
.equ	TWRA		= 4		; 0x10 - TWI Receive Acknowledge
.equ	TWC		= 3		; 0x08 - TWI Collision
.equ	TWBE		= 2		; 0x04 - TWI Bus Error
.equ	TWDIR		= 1		; 0x02 - TWI Read/Write Direction
.equ	TWAS		= 0		; 0x01 - TWI Address or Stop

; ----------	Register TWSA bits		------------------------
.equ	TWSA_MASK	= 0xFF		;      - TWI slave address bit (8 bits)
.equ	TWSA0		= 0		;          TWSA BIT0 position

; ----------	Register TWSD bits		------------------------
.equ	TWSD_MASK	= 0xFF		;      - TWI slave data bit (8 bits)
.equ	TWSD0		= 0		;          TWSD BIT0 position



