sterentev/atdf-device-asm-include/inc/ATtiny1634.inc
; ----------	Register UCSR1C bits		------------------------
.equ	UMSEL1_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL10		= 6		;          UMSEL1 BIT0 position
.equ	UPM1_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM10		= 4		;          UPM1 BIT0 position
.equ	USBS1		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ1_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ10		= 1		;          UCSZ1 BIT0 position
.equ	UCPOL1		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL1	:::: bitfield values
;			0x00		; Asynchronous USART
;			0x40		; Synchronous USART
;			0xC0		; Master SPI
; ::::  UPM1	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS1	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSR1D bits		------------------------
.equ	RXSIE1		= 7		; 0x80 - USART RX Start Interrupt Enable
.equ	RXS1		= 6		; 0x40 - USART RX Start Flag
.equ	SFDE1		= 5		; 0x20 - USART RX Start Frame Detection Enable



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timer Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timer Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 512 (16 ms)
;			0x01		; Oscillator Cycles 1K (32 ms)
;			0x02		; Oscillator Cycles 2K (64 ms)
;			0x03		; Oscillator Cycles 4K (0.125 s)
;			0x04		; Oscillator Cycles 8K (0.25 s)
;			0x05		; Oscillator Cycles 16K (0.5 s)
;			0x06		; Oscillator Cycles 32K (1.0 s)
;			0x07		; Oscillator Cycles 64K (2.0 s)
;			0x20		; Oscillator Cycles 128K (4.0 s)
;			0x21		; Oscillator Cycles 256K (8.0 s)




; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 47
.equ	INT_VECTORS_SIZE	= 0x5E
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	PCINT0		; Pin Change Interrupt Request 0
;	3	PCINT1		; Pin Change Interrupt Request 1
;	4	PCINT2		; Pin Change Interrupt Request 2
;	5	WDT		; Watchdog Time-out Interrupt
;	6	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	6	TIM1_CAPT	; Timer/Counter1 Capture Event
;	7	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	7	TIM1_COMPA	; Timer/Counter1 Compare Match A
;	8	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	8	TIM1_COMPB	; Timer/Counter1 Compare Match B
;	9	TIMER1_OVF	; Timer/Counter1 Overflow
;	9	TIM1_OVF	; Timer/Counter1 Overflow
;	10	TIMER0_COMPA	; TimerCounter0 Compare Match A
;	10	TIM0_COMPA	; TimerCounter0 Compare Match A
;	11	TIMER0_COMPB	; TimerCounter0 Compare Match B
;	11	TIM0_COMPB	; TimerCounter0 Compare Match B
;	12	TIMER0_OVF	; Timer/Counter0 Overflow
;	12	TIM0_OVF	; Timer/Counter0 Overflow
;	13	ANA_COMP	; Analog Comparator
;	14	ADC		; ADC Conversion Complete
;	14	ADC_READY	; ADC Conversion Complete
;	15	USART0_START	; USART0, Start
;	15	USART0_RXS	; USART0, Start
;	16	USART0_RX	; USART0, Rx Complete
;	16	USART0_RXC	; USART0, Rx Complete
;	17	USART0_UDRE	; USART0 Data Register Empty
;	17	USART0_DRE	; USART0 Data Register Empty
;	18	USART0_TX	; USART0, Tx Complete
;	18	USART0_TXC	; USART0, Tx Complete
;	19	USART1_START	; USART1, Start
;	19	USART1_RXS	; USART1, Start
;	20	USART1_RX	; USART1, Rx Complete
;	20	USART1_RXC	; USART1, Rx Complete
;	21	USART1_UDRE	; USART1 Data Register Empty
;	21	USART1_DRE	; USART1 Data Register Empty
;	22	USART1_TX	; USART1, Tx Complete
;	22	USART1_TXC	; USART1, Tx Complete
;	23	USI_START	; USI Start Condition
;	23	USI_STR		; USI Start Condition
;	24	USI_OVERFLOW	; USI Overflow
;	24	USI_OVF		; USI Overflow
;	25	TWI_SLAVE	; Two-wire Serial Interface
;	25	TWI		; Two-wire Serial Interface
;	26	EE_RDY		; EEPROM Ready
;	27	QTRIP		; Touch Sensing


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; PCINT2	 - Pin Change Interrupt Request 2
;#		reti			; WDT		 - Watchdog Time-out Interrupt
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIM1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIM1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIM1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIM1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - TimerCounter0 Compare Match A
;#		reti			; TIM0_COMPA	 - TimerCounter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - TimerCounter0 Compare Match B
;#		reti			; TIM0_COMPB	 - TimerCounter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; TIM0_OVF	 - Timer/Counter0 Overflow
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; ADC		 - ADC Conversion Complete
;#		reti			; ADC_READY	 - ADC Conversion Complete
;#		reti			; USART0_START	 - USART0, Start
;#		reti			; USART0_RXS	 - USART0, Start
;#		reti			; USART0_RX	 - USART0, Rx Complete
;#		reti			; USART0_RXC	 - USART0, Rx Complete
;#		reti			; USART0_UDRE	 - USART0 Data Register Empty
;#		reti			; USART0_DRE	 - USART0 Data Register Empty
;#		reti			; USART0_TX	 - USART0, Tx Complete
;#		reti			; USART0_TXC	 - USART0, Tx Complete
;#		reti			; USART1_START	 - USART1, Start
;#		reti			; USART1_RXS	 - USART1, Start
;#		reti			; USART1_RX	 - USART1, Rx Complete
;#		reti			; USART1_RXC	 - USART1, Rx Complete
;#		reti			; USART1_UDRE	 - USART1 Data Register Empty
;#		reti			; USART1_DRE	 - USART1 Data Register Empty
;#		reti			; USART1_TX	 - USART1, Tx Complete
;#		reti			; USART1_TXC	 - USART1, Tx Complete
;#		reti			; USI_START	 - USI Start Condition
;#		reti			; USI_STR	 - USI Start Condition
;#		reti			; USI_OVERFLOW	 - USI Overflow
;#		reti			; USI_OVF	 - USI Overflow
;#		reti			; TWI_SLAVE	 - Two-wire Serial Interface
;#		reti			; TWI		 - Two-wire Serial Interface
;#		rjmp	EE_RDY_ISR	; EE_RDY	 - EEPROM Ready
;#		reti			; QTRIP		 - Touch Sensing
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY1634_INC_ */

; ************************ END OF FILE *********************************

